Documents/СлужебнаяЗаписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>СлужебнаяЗаписка</Name>
			<BasedOn>
				<xr:Item>Document.Спецификация</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.АктВыполненияДоговора</xr:Item>
				<xr:Item>Document.Анкета</xr:Item>
				<xr:Item>Document.Встреча</xr:Item>
				<xr:Item>Document.ВыплатаЗаработнойПлаты</xr:Item>
				<xr:Item>Document.ВыпускПродукции</xr:Item>
				<xr:Item>Document.Договор</xr:Item>
				<xr:Item>Document.ДополнительноеСоглашение</xr:Item>
				<xr:Item>Document.Замер</xr:Item>
				<xr:Item>Document.ЗапланированноеВзаимодействие</xr:Item>
				<xr:Item>Document.ИнвентаризацияМатериалов</xr:Item>
				<xr:Item>Document.Инкассация</xr:Item>
				<xr:Item>Document.Комплектация</xr:Item>
				<xr:Item>Document.МодернизацияОС</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
				<xr:Item>Document.НазначениеОпросов</xr:Item>
				<xr:Item>Document.НарядЗадание</xr:Item>
				<xr:Item>Document.НачислениеАмортизации</xr:Item>
				<xr:Item>Document.НачислениеЗаработнойПлаты</xr:Item>
				<xr:Item>Document.НачислениеЗаработнойПлатыДизайнерам</xr:Item>
				<xr:Item>Document.ОперативныйЗакуп</xr:Item>
				<xr:Item>Document.Операция</xr:Item>
				<xr:Item>Document.ПеремещениеДенежныхСредств</xr:Item>
				<xr:Item>Document.ПеремещениеМатериалов</xr:Item>
				<xr:Item>Document.ПеремещениеОсновныхСредств</xr:Item>
				<xr:Item>Document.ПланРуководителя</xr:Item>
				<xr:Item>Document.ПоступлениеДополнительныхРасходов</xr:Item>
				<xr:Item>Document.ПоступлениеМатериаловУслуг</xr:Item>
				<xr:Item>Document.ПриходДенежныхСредств</xr:Item>
				<xr:Item>Document.РабочийГрафикМонтажников</xr:Item>
				<xr:Item>Document.РасходДенежныхСредств</xr:Item>
				<xr:Item>Document.РеализацияГотовойПродукции</xr:Item>
				<xr:Item>Document.РеализацияМатериалов</xr:Item>
				<xr:Item>Document.Рекламация</xr:Item>
				<xr:Item>Document.СлужебнаяЗаписка</xr:Item>
				<xr:Item>Document.СписаниеМатериаловСоСклада</xr:Item>
				<xr:Item>Document.СписаниеОсновныхСредств</xr:Item>
				<xr:Item>Document.ТелефонныйЗвонок</xr:Item>
				<xr:Item>Document.ТребованиеНакладная</xr:Item>
				<xr:Item>Document.УстановкаЛимитаРезерва</xr:Item>
				<xr:Item>Document.УстановкаЦенНоменклатуры</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоВходящее</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
				<xr:Item>Document.ОбзвонДоговоров</xr:Item>
				<xr:Item>Document.ПланПродажПоДизайнерам</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОшибкиСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адресат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСлужебнойЗаписки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСлужебнойЗаписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виновный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонтроля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСогласен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ознакомлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проблема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утверждаю</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ХранимыеФайлыВерсий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ХранимыеФайлыВерсий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранимыйФайл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВерсияФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСлужебнойЗаписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ВидыСлужебнойЗаписки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Благодарность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заявка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформированиеЗаявка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НарушенияВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поручение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПретензияЗаявление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удержание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СлужебнаяЗаписка/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	ФизЛицо = Пользователь.ФизическоеЛицо;
	ФизЛицоСтрока = ФизЛицо.Фамилия + " " + Лев(ФизЛицо.Имя, 1) + "." + Лев(ФизЛицо.Отчество, 1) + ".";
	                                                                         
	ПользовательАдминистратор = УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.Администратор);
	ПользовательКадроваяСлужба = УправлениеДоступомПереопределяемый.ЕстьДоступКПрофилюГруппДоступа(Пользователь, Справочники.ПрофилиГруппДоступа.КадроваяСлужба);
	         
	ДоступностьФормы = ПользовательКадроваяСлужба ИЛИ ПользовательАдминистратор;
	Элементы.Служебное.ТолькоПросмотр = НЕ ДоступностьФормы;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если НЕ ДоступностьФормы И (Объект.Автор <> Пользователь) И (Объект.Адресат <> Пользователь) Тогда
			
			//ЭтаФорма.ТолькоПросмотр = Истина;
			Элементы.Проблема.ТолькоПросмотр = Истина;
			Элементы.Адресат.ТолькоПросмотр = Истина;
			Элементы.ДатаКонтроля.ТолькоПросмотр = Истина;
			Элементы.ВидСлужебнойЗаписки.ТолькоПросмотр = Истина;	
			Элементы.Виновный.ТолькоПросмотр = Истина;
			Элементы.Тема.ТолькоПросмотр = Истина;
			Элементы.Сумма.ТолькоПросмотр = Истина;
			Элементы.Ознакомлен.ТолькоПросмотр = Истина;
			Элементы.НеСогласен.ТолькоПросмотр = Истина;
			Элементы.Утверждаю.ТолькоПросмотр = Истина;
					
		ИначеЕсли (Объект.Автор = ПараметрыСеанса.ТекущийПользователь) Тогда
			
			Элементы.Ответ.ТолькоПросмотр = Истина;
			Элементы.Ознакомлен.ТолькоПросмотр = Истина;
			Элементы.НеСогласен.ТолькоПросмотр = Истина;
			Элементы.Утверждаю.ТолькоПросмотр = Истина;
			
		ИначеЕсли (Объект.Адресат = ПараметрыСеанса.ТекущийПользователь) Тогда
			
			Элементы.Проблема.ТолькоПросмотр = Истина;	
			Элементы.ДатаКонтроля.ТолькоПросмотр = Истина;
			Элементы.ВидСлужебнойЗаписки.ТолькоПросмотр = Истина;	
			Элементы.Виновный.ТолькоПросмотр = Истина;
			Элементы.Тема.ТолькоПросмотр = Истина;
			Элементы.Утверждаю.ТолькоПросмотр = Истина;
			
			Если Объект.ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.Заявка
				ИЛИ Объект.ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.Поручение
				ИЛИ Объект.ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.ПретензияЗаявление Тогда
				Элементы.Выполнена.ТолькоПросмотр = Ложь;
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		
		Элементы.Ответ.ТолькоПросмотр = Истина;
		Элементы.Ознакомлен.ТолькоПросмотр = Истина;
		Элементы.НеСогласен.ТолькоПросмотр = Истина;
		Элементы.Утверждаю.ТолькоПросмотр = Истина;
		
		Если Объект.ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.Заявка
				ИЛИ Объект.ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.Поручение
				ИЛИ Объект.ВидСлужебнойЗаписки = Перечисления.ВидыСлужебнойЗаписки.ПретензияЗаявление Тогда
				Элементы.Выполнена.ТолькоПросмотр = Ложь;
			КонецЕсли;
			
	КонецЕсли;
	
	//Если Объект.Дата 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ХранимыеФайлыВерсий.ВерсияФайла) КАК Количество
	|ИЗ
	|	РегистрСведений.ХранимыеФайлыВерсий КАК ХранимыеФайлыВерсий
	|ГДЕ
	|	ХранимыеФайлыВерсий.ВерсияФайла.Владелец.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	КоличествоФайлов = Выборка.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Отказ = НЕ ПроверитьЗаполнение();
	
	Объект.Проблема = СокрЛП(Объект.Проблема);
	Объект.Ответ = СокрЛП(Объект.Ответ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорученияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОтвета) Тогда
		Объект.ДатаОтвета = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	НашТекстОтвета = Символы.ПС + ФизЛицоСтрока + "[" + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") + "]: "+ ТекстОтвета;
	
	Если ЗначениеЗаполнено(Объект.Проблема) Тогда
		Объект.Проблема = Объект.Проблема + Символы.ПС + НашТекстОтвета;
	Иначе
		Объект.Проблема = НашТекстОтвета;
	КонецЕсли;
 
	ТекстОтвета = "";
	
КонецПроцедуры
